[NoCoverage] BlockStatement
src/email/email.controller.ts:12:53
     sendEmailServices:SendEmailServices
 
     // Constructor
-    constructor(sendEmailServices:SendEmailServices){
-        this.sendEmailServices = sendEmailServices
-    }
+    constructor(sendEmailServices:SendEmailServices){}
 
     // Request get

[NoCoverage] BlockStatement
src/email/email.controller.ts:18:18
 
     // Request get
     @Get()
-    initialPage(){
-        return JSON.stringify({
-            message:'Study-io APi for send email'
-        })
-    }
+    initialPage(){}
 
     // Request Post

[NoCoverage] ObjectLiteral
src/email/email.controller.ts:19:31
     // Request get
     @Get()
     initialPage(){
-        return JSON.stringify({
-            message:'Study-io APi for send email'
-        })
+        return JSON.stringify({})
     }
 

[NoCoverage] BlockStatement
src/email/email.controller.ts:26:52
 
     // Request Post
     @Post()
-    async sendEmail(@Body() userEmail:SendEmailDto){
-        try {
-
-            // Iniciando a verificação do email
-            const isEmailFromStudy = await this.sendEmailServices.verifyUser(userEmail.emailForVerification)
-            
-            // Caso o email seja um email cadastrado no app Study-io
-            if(isEmailFromStudy){
-                this.sendEmailServices.sendEmail(userEmail)
-                return JSON.stringify({
-                    message:'O seu email foi enviado para a equipe da Study-io'
-                })
-            }
-
-            // Caso o email não seja verficado
-            return JSON.stringify({
-                message:'Email não está cadastrado no app Study-io'
-            })
-            
-        } catch (error) {
-            return 'Algo deu errado!'
-        }
-    }
+    async sendEmail(@Body() userEmail:SendEmailDto){}
 }
 

[NoCoverage] BlockStatement
src/email/email.controller.ts:27:13
     // Request Post
     @Post()
     async sendEmail(@Body() userEmail:SendEmailDto){
-        try {
-
-            // Iniciando a verificação do email
-            const isEmailFromStudy = await this.sendEmailServices.verifyUser(userEmail.emailForVerification)
-            
-            // Caso o email seja um email cadastrado no app Study-io
-            if(isEmailFromStudy){
-                this.sendEmailServices.sendEmail(userEmail)
-                return JSON.stringify({
-                    message:'O seu email foi enviado para a equipe da Study-io'
-                })
-            }
-
-            // Caso o email não seja verficado
-            return JSON.stringify({
-                message:'Email não está cadastrado no app Study-io'
-            })
-            
-        } catch (error) {
+        try {} catch (error) {
             return 'Algo deu errado!'
         }

[NoCoverage] BlockStatement
src/email/email.controller.ts:33:33
             const isEmailFromStudy = await this.sendEmailServices.verifyUser(userEmail.emailForVerification)
             
             // Caso o email seja um email cadastrado no app Study-io
-            if(isEmailFromStudy){
-                this.sendEmailServices.sendEmail(userEmail)
-                return JSON.stringify({
-                    message:'O seu email foi enviado para a equipe da Study-io'
-                })
-            }
+            if(isEmailFromStudy){}
 
             // Caso o email não seja verficado

[NoCoverage] ConditionalExpression
src/email/email.controller.ts:33:16
             const isEmailFromStudy = await this.sendEmailServices.verifyUser(userEmail.emailForVerification)
             
             // Caso o email seja um email cadastrado no app Study-io
-            if(isEmailFromStudy){
+            if(false){
                 this.sendEmailServices.sendEmail(userEmail)
                 return JSON.stringify({

[NoCoverage] ObjectLiteral
src/email/email.controller.ts:35:39
             // Caso o email seja um email cadastrado no app Study-io
             if(isEmailFromStudy){
                 this.sendEmailServices.sendEmail(userEmail)
-                return JSON.stringify({
-                    message:'O seu email foi enviado para a equipe da Study-io'
-                })
+                return JSON.stringify({})
             }
 

[NoCoverage] StringLiteral
src/email/email.controller.ts:36:29
             if(isEmailFromStudy){
                 this.sendEmailServices.sendEmail(userEmail)
                 return JSON.stringify({
-                    message:'O seu email foi enviado para a equipe da Study-io'
+                    message:""
                 })
             }

[NoCoverage] StringLiteral
src/email/email.controller.ts:42:25
 
             // Caso o email não seja verficado
             return JSON.stringify({
-                message:'Email não está cadastrado no app Study-io'
+                message:""
             })
             

[NoCoverage] BlockStatement
src/email/email.controller.ts:45:25
                 message:'Email não está cadastrado no app Study-io'
             })
             
-        } catch (error) {
-            return 'Algo deu errado!'
-        }
+        } catch (error) {}
     }
 }
