[NoCoverage] BlockStatement
src/auth/auth.controller.ts:21:18
   constructor(private readonly authService: AuthService) {}
 
   @Get()
-  async welcome(){
-    return { message: 'Hello, raquest login in /login or /register' }
-  }
+  async welcome(){}
 
   @UseGuards(AuthGuard)

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:27:39
 
   @UseGuards(AuthGuard)
   @Get('onAuth')
-  async onAuth(@Headers() headers:any){
-    return this.authService.verifyToken(headers.authorization.split(' ')[1])
-  }
+  async onAuth(@Headers() headers:any){}
 
   @UseGuards(AuthGuard)

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:33:44
 
   @UseGuards(AuthGuard)
   @Get('getData')
-  async getDataUser(@Headers() headers:any){
-    const token = headers.authorization.split(' ')[1]
-    return await this.authService.getData(token)
-  }
+  async getDataUser(@Headers() headers:any){}
 
   @Post('register')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:39:66
   }
 
   @Post('register')
-  async registerUser(@Body() data: AuthRegisterDto, res:Response){
-    return await this.authService.registerUser(data)
-  }
+  async registerUser(@Body() data: AuthRegisterDto, res:Response){}
 
   @Post('login')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:44:45
   }
 
   @Post('login')
-  async loginUser(@Body() data:AuthLoginDto){
-    return await this.authService.loginUser(data)
-  }
+  async loginUser(@Body() data:AuthLoginDto){}
 }
 
