[NoCoverage] BlockStatement
src/auth/auth.repository.ts:26:30
     ){}
 
     // Verify token
-    verifyToken(token:string){
-        try {
-            if(this.jwtService.verify(token)){
-                return true
-            }
-        } catch (error) {
-            return false
-        }
-    }
+    verifyToken(token:string){}
 
     // get Data user

[NoCoverage] BlockStatement
src/auth/auth.repository.ts:27:13
 
     // Verify token
     verifyToken(token:string){
-        try {
-            if(this.jwtService.verify(token)){
-                return true
-            }
-        } catch (error) {
+        try {} catch (error) {
             return false
         }

[NoCoverage] ConditionalExpression
src/auth/auth.repository.ts:28:16
     // Verify token
     verifyToken(token:string){
         try {
-            if(this.jwtService.verify(token)){
+            if(false){
                 return true
             }

[NoCoverage] ConditionalExpression
src/auth/auth.repository.ts:28:16
     // Verify token
     verifyToken(token:string){
         try {
-            if(this.jwtService.verify(token)){
+            if(true){
                 return true
             }

[NoCoverage] BooleanLiteral
src/auth/auth.repository.ts:29:24
     verifyToken(token:string){
         try {
             if(this.jwtService.verify(token)){
-                return true
+                return false
             }
         } catch (error) {

[NoCoverage] BlockStatement
src/auth/auth.repository.ts:31:25
             if(this.jwtService.verify(token)){
                 return true
             }
-        } catch (error) {
-            return false
-        }
+        } catch (error) {}
     }
 

[NoCoverage] ArrayDeclaration
src/auth/auth.repository.ts:43:62
             const user = this.jwtService.verify(token)
 
             // Request tasks, notes and kanban for user
-            const [tasks, notes, kanban] = await Promise.all([
-                this.prisma.task.findMany({ where:{ userId: user.id } }),
-                this.prisma.note.findMany({ where:{ userId: user.id } }),
-                this.prisma.kanban.findMany({
-                     select: { 
-                        tasks: { where: { userId: user.id } }, 
-                        devTask: { where: { userId: user.id } },
-                        pauseTask: { where: { userId: user.id } }, 
-                        completeTask: { where: { userId: user.id } }, 
-                    } 
-                })
-            ])
+            const [tasks, notes, kanban] = await Promise.all([])
 
             // New template data

[NoCoverage] ObjectLiteral
src/auth/auth.repository.ts:44:43
 
             // Request tasks, notes and kanban for user
             const [tasks, notes, kanban] = await Promise.all([
-                this.prisma.task.findMany({ where:{ userId: user.id } }),
+                this.prisma.task.findMany({}),
                 this.prisma.note.findMany({ where:{ userId: user.id } }),
                 this.prisma.kanban.findMany({

[NoCoverage] ObjectLiteral
src/auth/auth.repository.ts:46:45
             const [tasks, notes, kanban] = await Promise.all([
                 this.prisma.task.findMany({ where:{ userId: user.id } }),
                 this.prisma.note.findMany({ where:{ userId: user.id } }),
-                this.prisma.kanban.findMany({
-                     select: { 
-                        tasks: { where: { userId: user.id } }, 
-                        devTask: { where: { userId: user.id } },
-                        pauseTask: { where: { userId: user.id } }, 
-                        completeTask: { where: { userId: user.id } }, 
-                    } 
-                })
+                this.prisma.kanban.findMany({})
             ])
 

[NoCoverage] ObjectLiteral
src/auth/auth.repository.ts:47:30
                 this.prisma.task.findMany({ where:{ userId: user.id } }),
                 this.prisma.note.findMany({ where:{ userId: user.id } }),
                 this.prisma.kanban.findMany({
-                     select: { 
-                        tasks: { where: { userId: user.id } }, 
-                        devTask: { where: { userId: user.id } },
-                        pauseTask: { where: { userId: user.id } }, 
-                        completeTask: { where: { userId: user.id } }, 
-                    } 
+                     select: {} 
                 })
             ])

[NoCoverage] ObjectLiteral
src/auth/auth.repository.ts:48:41
                 this.prisma.note.findMany({ where:{ userId: user.id } }),
                 this.prisma.kanban.findMany({
                      select: { 
-                        tasks: { where: { userId: user.id } }, 
+                        tasks: { where: {} }, 
                         devTask: { where: { userId: user.id } },
                         pauseTask: { where: { userId: user.id } }, 

[NoCoverage] ObjectLiteral
src/auth/auth.repository.ts:51:39
                         tasks: { where: { userId: user.id } }, 
                         devTask: { where: { userId: user.id } },
                         pauseTask: { where: { userId: user.id } }, 
-                        completeTask: { where: { userId: user.id } }, 
+                        completeTask: {}, 
                     } 
                 })

[NoCoverage] BlockStatement
src/auth/auth.repository.ts:65:25
             }
 
             return newUserData
-        } catch (error) {
-            console.log(error)
-        }
+        } catch (error) {}
     }
 

[NoCoverage] BlockStatement
src/auth/auth.repository.ts:71:46
     }
 
     // Register user
-    async registerUser(data: AuthRegisterDto){
-        const user = await this.signUpService.createUser(data.email, data.username, data.password)
-
-        if(user){
-            const token = this.jwtService.sign(user)
-
-            return { token }
-        }
-        
-    }
+    async registerUser(data: AuthRegisterDto){}
 
     // Login user

[NoCoverage] BlockStatement
src/auth/auth.repository.ts:74:17
     async registerUser(data: AuthRegisterDto){
         const user = await this.signUpService.createUser(data.email, data.username, data.password)
 
-        if(user){
-            const token = this.jwtService.sign(user)
-
-            return { token }
-        }
+        if(user){}
         
     }

[NoCoverage] ObjectLiteral
src/auth/auth.repository.ts:77:20
         if(user){
             const token = this.jwtService.sign(user)
 
-            return { token }
+            return {}
         }
         

[NoCoverage] BlockStatement
src/auth/auth.repository.ts:83:40
     }
 
     // Login user
-    async loginUser(data: AuthLoginDto){
-        const user = await this.signInService.signIn(data.email, data.password)
-
-        if(user){
-            const token = this.jwtService.sign(user)
-
-            return { token }
-        } 
-    }
+    async loginUser(data: AuthLoginDto){}
 }
