[NoCoverage] BlockStatement
src/email/email.repository.ts:11:39
 
     repository:ResendService
 
-    constructor(resend: ResendService){
-        this.repository = resend
-    }
+    constructor(resend: ResendService){}
 
     async verifyUser(email:string){

[NoCoverage] BlockStatement
src/email/email.repository.ts:15:35
         this.repository = resend
     }
 
-    async verifyUser(email:string){
-        try {
-
-            // Array para armazenar todos os usuários
-            let usersArray = []
-
-            // Buscando usuários do banco de dados
-
-            // Percorrendo cada snap e adicionando usuário ao array
-
-            // Buscando o usuário que está enviando o feedback
-            const emailIsVerifiedOrNo = usersArray.filter(user => user.dataUser.email === email)
-
-            // Retornando true caso o usuário seja client do app study-io
-            return emailIsVerifiedOrNo.length === 1 ? true : false
-
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async verifyUser(email:string){}
 
     async sendEmail(data:SendEmailDto){

[NoCoverage] BlockStatement
src/email/email.repository.ts:16:13
     }
 
     async verifyUser(email:string){
-        try {
-
-            // Array para armazenar todos os usuários
-            let usersArray = []
-
-            // Buscando usuários do banco de dados
-
-            // Percorrendo cada snap e adicionando usuário ao array
-
-            // Buscando o usuário que está enviando o feedback
-            const emailIsVerifiedOrNo = usersArray.filter(user => user.dataUser.email === email)
-
-            // Retornando true caso o usuário seja client do app study-io
-            return emailIsVerifiedOrNo.length === 1 ? true : false
-
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] ConditionalExpression
src/email/email.repository.ts:26:67
             // Percorrendo cada snap e adicionando usuário ao array
 
             // Buscando o usuário que está enviando o feedback
-            const emailIsVerifiedOrNo = usersArray.filter(user => user.dataUser.email === email)
+            const emailIsVerifiedOrNo = usersArray.filter(user => true)
 
             // Retornando true caso o usuário seja client do app study-io

[NoCoverage] MethodExpression
src/email/email.repository.ts:26:41
             // Percorrendo cada snap e adicionando usuário ao array
 
             // Buscando o usuário que está enviando o feedback
-            const emailIsVerifiedOrNo = usersArray.filter(user => user.dataUser.email === email)
+            const emailIsVerifiedOrNo = usersArray
 
             // Retornando true caso o usuário seja client do app study-io

[NoCoverage] EqualityOperator
src/email/email.repository.ts:29:20
             const emailIsVerifiedOrNo = usersArray.filter(user => user.dataUser.email === email)
 
             // Retornando true caso o usuário seja client do app study-io
-            return emailIsVerifiedOrNo.length === 1 ? true : false
+            return emailIsVerifiedOrNo.length !== 1 ? true : false
 
         } catch (error) {

[NoCoverage] BooleanLiteral
src/email/email.repository.ts:29:55
             const emailIsVerifiedOrNo = usersArray.filter(user => user.dataUser.email === email)
 
             // Retornando true caso o usuário seja client do app study-io
-            return emailIsVerifiedOrNo.length === 1 ? true : false
+            return emailIsVerifiedOrNo.length === 1 ? false : false
 
         } catch (error) {

[NoCoverage] BlockStatement
src/email/email.repository.ts:31:25
             // Retornando true caso o usuário seja client do app study-io
             return emailIsVerifiedOrNo.length === 1 ? true : false
 
-        } catch (error) {
-            console.log(error)
-        }
+        } catch (error) {}
     }
 

[NoCoverage] BlockStatement
src/email/email.repository.ts:36:39
         }
     }
 
-    async sendEmail(data:SendEmailDto){
-        try {
-            await this.repository.send({
-                from:data.emailForOrganization,
-                to:'thomazhilario5@gmail.com',
-                subject:data.subject,
-                html:data.html
-            })           
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async sendEmail(data:SendEmailDto){}
 }

[NoCoverage] BlockStatement
src/email/email.repository.ts:37:13
     }
 
     async sendEmail(data:SendEmailDto){
-        try {
-            await this.repository.send({
-                from:data.emailForOrganization,
-                to:'thomazhilario5@gmail.com',
-                subject:data.subject,
-                html:data.html
-            })           
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] BlockStatement
src/email/email.repository.ts:44:25
                 subject:data.subject,
                 html:data.html
             })           
-        } catch (error) {
-            console.log(error)
-        }
+        } catch (error) {}
     }
 }
