[NoCoverage] BlockStatement
src/email/email.service.ts:11:43
     
     service:SendEmailRepository
 
-    constructor(repo: SendEmailRepository){
-        this.service = repo
-    }
+    constructor(repo: SendEmailRepository){}
 
     async verifyUser(email:string){

[NoCoverage] BlockStatement
src/email/email.service.ts:15:35
         this.service = repo
     }
 
-    async verifyUser(email:string){
-        return await this.service.verifyUser(email)
-    }
+    async verifyUser(email:string){}
 
     async sendEmail(data:SendEmailDto){

[NoCoverage] BlockStatement
src/email/email.service.ts:19:39
         return await this.service.verifyUser(email)
     }
 
-    async sendEmail(data:SendEmailDto){
-        try {
-            await this.service.sendEmail(data)
-
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async sendEmail(data:SendEmailDto){}
 }

[NoCoverage] BlockStatement
src/email/email.service.ts:20:13
     }
 
     async sendEmail(data:SendEmailDto){
-        try {
-            await this.service.sendEmail(data)
-
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }
