[NoCoverage] BlockStatement
src/auth/auth.service.ts:15:30
     // Constructor
     constructor(private AuthRepository:AuthRepository){}
 
-    verifyToken(token:string){
-        return this.AuthRepository.verifyToken(token)
-    }
+    verifyToken(token:string){}
 
     // get data user

[NoCoverage] BlockStatement
src/auth/auth.service.ts:20:29
     }
 
     // get data user
-    async getData(id:string){
-        return await this.AuthRepository.getData(id)
-    }
+    async getData(id:string){}
 
     // Register user

[NoCoverage] BlockStatement
src/auth/auth.service.ts:25:46
     }
 
     // Register user
-    async registerUser(data: AuthRegisterDto){
-        return await this.AuthRepository.registerUser(data)
-    }
+    async registerUser(data: AuthRegisterDto){}
 
     // Login user

[NoCoverage] BlockStatement
src/auth/auth.service.ts:30:40
     }
 
     // Login user
-    async loginUser(data: AuthLoginDto){
-        return await this.AuthRepository.loginUser(data)
-    }
+    async loginUser(data: AuthLoginDto){}
 }
 
