[NoCoverage] BlockStatement
src/KeepAlive.service.ts:17:23
     constructor(private prisma:PrismaService){}
 
     @Cron('0 */8 * * *')
-    async handleCron(){
-        try {
-            // Request in database
-            await this.prisma.$queryRaw`SELECT 1`  
-
-            // Log message
-            this.logger.log('Conection pool is stable')          
-        } catch (error) {
-            // Log message
-            this.logger.error('Connection poll not is stable', error)
-        }
-    }
+    async handleCron(){}
 }
 

[NoCoverage] BlockStatement
src/KeepAlive.service.ts:18:13
 
     @Cron('0 */8 * * *')
     async handleCron(){
-        try {
-            // Request in database
-            await this.prisma.$queryRaw`SELECT 1`  
-
-            // Log message
-            this.logger.log('Conection pool is stable')          
-        } catch (error) {
+        try {} catch (error) {
             // Log message
             this.logger.error('Connection poll not is stable', error)

[NoCoverage] BlockStatement
src/KeepAlive.service.ts:24:25
 
             // Log message
             this.logger.log('Conection pool is stable')          
-        } catch (error) {
-            // Log message
-            this.logger.error('Connection poll not is stable', error)
-        }
+        } catch (error) {}
     }
 }
