[NoCoverage] BlockStatement
src/guards/auth.guard.ts:10:92
 
     constructor(private authService:AuthService){}
 
-  canActivate(context: ExecutionContext): boolean | Promise<boolean> | Observable<boolean> {
-    const token = context.switchToHttp().getRequest().headers.authorization.split(' ')[1];
-
-    if(token){
-        return true
-    }
-
-    return false
-  }
+  canActivate(context: ExecutionContext): boolean | Promise<boolean> | Observable<boolean> {}
 }

[NoCoverage] StringLiteral
src/guards/auth.guard.ts:11:83
     constructor(private authService:AuthService){}
 
   canActivate(context: ExecutionContext): boolean | Promise<boolean> | Observable<boolean> {
-    const token = context.switchToHttp().getRequest().headers.authorization.split(' ')[1];
+    const token = context.switchToHttp().getRequest().headers.authorization.split("")[1];
 
     if(token){

[NoCoverage] BooleanLiteral
src/guards/auth.guard.ts:14:16
     const token = context.switchToHttp().getRequest().headers.authorization.split(' ')[1];
 
     if(token){
-        return true
+        return false
     }
 
