[NoCoverage] BlockStatement
src/main.ts:11:28
 // Iniciando o dotenv
 dotenv.config()
 
-async function bootstrap() {
-  const app = await NestFactory.create(MainModule, {cors:true});
-  
-  // Active cors
-  app.enableCors()
-
-  // Enable cookies
-  app.use(cookieParser())
-
-  // Global Pipes
-  app.useGlobalPipes(
-    new ValidationPipe()
-  )
-
-  await app.listen(process.env.PORT || 3000);
-}
+async function bootstrap() {}
 bootstrap();
 

[NoCoverage] BooleanLiteral
src/main.ts:12:58
 dotenv.config()
 
 async function bootstrap() {
-  const app = await NestFactory.create(MainModule, {cors:true});
+  const app = await NestFactory.create(MainModule, {cors:false});
   
   // Active cors

[NoCoverage] ConditionalExpression
src/main.ts:25:20
     new ValidationPipe()
   )
 
-  await app.listen(process.env.PORT || 3000);
+  await app.listen(false);
 }
 bootstrap();

[NoCoverage] LogicalOperator
src/main.ts:25:20
     new ValidationPipe()
   )
 
-  await app.listen(process.env.PORT || 3000);
+  await app.listen(process.env.PORT && 3000);
 }
 bootstrap();
