[NoCoverage] BlockStatement
src/notes/notes.controller.ts:15:40
   constructor(private readonly notesService: NotesService) {}
 
   @Get()
-  async getAllNotes(@Req() req:Request){
-    // Get id from userId
-    const userId = req.cookies['user']
-
-    // Return all notes
-    if(userId){
-      return await this.notesService.getAllNotes(userId)
-    }
-
-    // Message section expire
-    return{
-      message:'Your section expired!'
-    }
-  }
+  async getAllNotes(@Req() req:Request){}
 
   @Post()

[NoCoverage] StringLiteral
src/notes/notes.controller.ts:17:32
   @Get()
   async getAllNotes(@Req() req:Request){
     // Get id from userId
-    const userId = req.cookies['user']
+    const userId = req.cookies[""]
 
     // Return all notes

[NoCoverage] BlockStatement
src/notes/notes.controller.ts:20:15
     const userId = req.cookies['user']
 
     // Return all notes
-    if(userId){
-      return await this.notesService.getAllNotes(userId)
-    }
+    if(userId){}
 
     // Message section expire

[NoCoverage] ConditionalExpression
src/notes/notes.controller.ts:20:8
     const userId = req.cookies['user']
 
     // Return all notes
-    if(userId){
+    if(false){
       return await this.notesService.getAllNotes(userId)
     }

[NoCoverage] StringLiteral
src/notes/notes.controller.ts:26:15
 
     // Message section expire
     return{
-      message:'Your section expired!'
+      message:""
     }
   }

[NoCoverage] BlockStatement
src/notes/notes.controller.ts:31:64
   }
 
   @Post()
-  async createNote(@Req() req:Request, @Body() values:NotesDto){
-    // Get id from userId
-    const userId = req.cookies['user']
-
-    // Return all notes
-    if(userId){
-      return await this.notesService.createNote(values.name, userId)
-    }
-
-    // Message section expire
-    return{
-      message:'Your section expired!'
-    }
-  }
+  async createNote(@Req() req:Request, @Body() values:NotesDto){}
 
   @Patch()

[NoCoverage] BlockStatement
src/notes/notes.controller.ts:36:15
     const userId = req.cookies['user']
 
     // Return all notes
-    if(userId){
-      return await this.notesService.createNote(values.name, userId)
-    }
+    if(userId){}
 
     // Message section expire

[NoCoverage] BlockStatement
src/notes/notes.controller.ts:47:64
   }
 
   @Patch()
-  async updateNote(@Req() req:Request, @Body() values:NotesDto){
-    // Get id from userId
-    const userId = req.cookies['user']
-
-    // Return all notes
-    if(userId){
-      return await this.notesService.updateNote(values.name, values.noteId)
-    }
-
-    // Message section expire
-    return{
-      message:'Your section expired!'
-    }
-  }
+  async updateNote(@Req() req:Request, @Body() values:NotesDto){}
 
   @Delete()

[NoCoverage] ConditionalExpression
src/notes/notes.controller.ts:52:8
     const userId = req.cookies['user']
 
     // Return all notes
-    if(userId){
+    if(true){
       return await this.notesService.updateNote(values.name, values.noteId)
     }

[NoCoverage] BlockStatement
src/notes/notes.controller.ts:63:64
   }
 
   @Delete()
-  async deleteNote(@Req() req:Request, @Body() values:NotesDto){
-    // Get id from userId
-    const userId = req.cookies['user']
-
-    // Return all notes
-    if(userId){
-      return await this.notesService.deleteNote(values.noteId)
-    }
-
-    // Message section expire
-    return{
-      message:'Your section expired!'
-    }
-  }
+  async deleteNote(@Req() req:Request, @Body() values:NotesDto){}
 }
 

[NoCoverage] BlockStatement
src/notes/notes.controller.ts:68:15
     const userId = req.cookies['user']
 
     // Return all notes
-    if(userId){
-      return await this.notesService.deleteNote(values.noteId)
-    }
+    if(userId){}
 
     // Message section expire
