[NoCoverage] BlockStatement
src/notes/notes.repository.ts:13:37
     constructor(private prisma:PrismaService){}
 
     // Get all notes
-    async getAllNotes(userId:string){
-        try {
-            // Get all notes
-            const notes = await this.prisma.note.findMany({
-                where:{ userId }
-            })  
-            
-            // Return notes
-            return notes
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async getAllNotes(userId:string){}
 
     // Create notes

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:14:13
 
     // Get all notes
     async getAllNotes(userId:string){
-        try {
-            // Get all notes
-            const notes = await this.prisma.note.findMany({
-                where:{ userId }
-            })  
-            
-            // Return notes
-            return notes
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:22:25
             
             // Return notes
             return notes
-        } catch (error) {
-            console.log(error)
-        }
+        } catch (error) {}
     }
 

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:28:49
     }
 
     // Create notes
-    async createNote(name:string, userId:string){
-        try {
-            // Create note
-            await this.prisma.note.create({
-                data:{
-                    id:crypto.randomUUID(),
-                    name,
-                    date: new Date(),
-                    userId:userId
-                }
-            })
-
-            // Return message
-            return {
-                message:'Created note'
-            }
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async createNote(name:string, userId:string){}
 
     // Update note

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:29:13
 
     // Create notes
     async createNote(name:string, userId:string){
-        try {
-            // Create note
-            await this.prisma.note.create({
-                data:{
-                    id:crypto.randomUUID(),
-                    name,
-                    date: new Date(),
-                    userId:userId
-                }
-            })
-
-            // Return message
-            return {
-                message:'Created note'
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:44:25
             return {
                 message:'Created note'
             }
-        } catch (error) {
-            console.log(error)
-        }
+        } catch (error) {}
     }
 

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:51:13
 
     // Update note
     async updateNote(name?:string, noteId?:string){
-        try {
-            // Update note
-            await this.prisma.note.update({
-                where:{
-                    id:noteId
-                },
-
-                data:{
-                    name:name,
-                    date:new Date()
-                }
-            })
-
-            // Return sucess message
-            return {
-                message:'Note updated!'
-            }
-        } catch (error) {
+        try {} catch (error) {
             if(error){
                 return{

[NoCoverage] ObjectLiteral
src/notes/notes.repository.ts:58:22
                     id:noteId
                 },
 
-                data:{
-                    name:name,
-                    date:new Date()
-                }
+                data:{}
             })
 

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:68:25
             return {
                 message:'Note updated!'
             }
-        } catch (error) {
-            if(error){
-                return{
-                    message:'This task not exist!'
-                }
-            }
-        }
+        } catch (error) {}
     }
 

[NoCoverage] ConditionalExpression
src/notes/notes.repository.ts:69:16
                 message:'Note updated!'
             }
         } catch (error) {
-            if(error){
+            if(true){
                 return{
                     message:'This task not exist!'

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:69:22
                 message:'Note updated!'
             }
         } catch (error) {
-            if(error){
-                return{
-                    message:'This task not exist!'
-                }
-            }
+            if(error){}
         }
     }

[NoCoverage] StringLiteral
src/notes/notes.repository.ts:71:29
         } catch (error) {
             if(error){
                 return{
-                    message:'This task not exist!'
+                    message:""
                 }
             }

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:78:36
     }
 
     // Delete note
-    async deleteNote(noteId:string){
-        try {
-            // Delete note
-            await this.prisma.note.delete({
-                where:{
-                    id:noteId
-                }
-            })
-
-            // Return message
-            return {
-                message:'Note deleted!'
-            }
-        } catch (error) {
-            if(error){
-                return{
-                    message:'This task not exist!'
-                }
-            }
-        }
-    }
+    async deleteNote(noteId:string){}
 }

[NoCoverage] BlockStatement
src/notes/notes.repository.ts:79:13
 
     // Delete note
     async deleteNote(noteId:string){
-        try {
-            // Delete note
-            await this.prisma.note.delete({
-                where:{
-                    id:noteId
-                }
-            })
-
-            // Return message
-            return {
-                message:'Note deleted!'
-            }
-        } catch (error) {
+        try {} catch (error) {
             if(error){
                 return{

[NoCoverage] ObjectLiteral
src/notes/notes.repository.ts:82:23
         try {
             // Delete note
             await this.prisma.note.delete({
-                where:{
-                    id:noteId
-                }
+                where:{}
             })
 

[NoCoverage] StringLiteral
src/notes/notes.repository.ts:89:25
 
             // Return message
             return {
-                message:'Note deleted!'
+                message:""
             }
         } catch (error) {

[NoCoverage] ConditionalExpression
src/notes/notes.repository.ts:92:16
                 message:'Note deleted!'
             }
         } catch (error) {
-            if(error){
+            if(false){
                 return{
                     message:'This task not exist!'
