[NoCoverage] BlockStatement
src/notes/notes.service.ts:13:37
     constructor(private NotesRepository:NotesRepository){}
 
     // Get all notes
-    async getAllNotes(userId:string){
-        return await this.NotesRepository.getAllNotes(userId)
-    }
+    async getAllNotes(userId:string){}
 
     // Create note

[NoCoverage] BlockStatement
src/notes/notes.service.ts:18:49
     }
 
     // Create note
-    async createNote(name:string, userId:string){
-        return await this.NotesRepository.createNote(name, userId)
-    }
+    async createNote(name:string, userId:string){}
 
     // Update note

[NoCoverage] BlockStatement
src/notes/notes.service.ts:23:51
     }
 
     // Update note
-    async updateNote(name?:string, noteId?:string){
-        return await this.NotesRepository.updateNote(name, noteId)
-    }
+    async updateNote(name?:string, noteId?:string){}
 
     // Delete note

[NoCoverage] BlockStatement
src/notes/notes.service.ts:28:36
     }
 
     // Delete note
-    async deleteNote(noteId:string){
-        return await this.NotesRepository.deleteNote(noteId)
-    }
+    async deleteNote(noteId:string){}
 }
 
