[NoCoverage] BlockStatement
src/prisma.service.ts:6:26
 
 @Injectable()
 export class PrismaService extends PrismaClient implements OnModuleInit{
-    async onModuleInit() {
-        await this.$connect()
-    }
+    async onModuleInit() {}
 }
