[NoCoverage] BlockStatement
src/sign-in/sign-in.controller.ts:18:72
   constructor(private readonly signInService: SignInService) {}
 
   @Post()
-  async signIn(@Body() credentials:SignInDto, @Res() response:Response){
-    const result = await this.signInService.signIn(credentials.email, credentials.password)
-
-    // Return id
-    if(result){
-
-      // Return result
-      return response.send(result)
-    }
-
-    // return message error
-    return result
-  }
+  async signIn(@Body() credentials:SignInDto, @Res() response:Response){}
 }
 

[NoCoverage] ConditionalExpression
src/sign-in/sign-in.controller.ts:22:8
     const result = await this.signInService.signIn(credentials.email, credentials.password)
 
     // Return id
-    if(result){
+    if(true){
 
       // Return result

[NoCoverage] ConditionalExpression
src/sign-in/sign-in.controller.ts:22:8
     const result = await this.signInService.signIn(credentials.email, credentials.password)
 
     // Return id
-    if(result){
+    if(false){
 
       // Return result
