[NoCoverage] BlockStatement
src/sign-in/sign-in.repository.ts:21:13
 
     // SignIN user
     async signIn(email:string, password:string){
-        try {
-
-            // Get all users
-            const user = await this.prisma.user.findUnique({
-                where:{
-                    email
-                }
-            })
-
-            // Case have user
-            if(user){
-                // Compare hash in databse with hash digited
-                const passwordIsEqualForHash = await bcrypt.compare(password, user.password)
-
-                if(passwordIsEqualForHash) return user
-               
-                throw new Error('Password invalid!')
-            }
-
-            //  message for user
-            throw new Error('Email not is exist in database!')
-            
-        } catch (error) {
+        try {} catch (error) {
             throw new BadRequestException ({
                 statusCode: HttpStatus.CONFLICT,

[NoCoverage] ConditionalExpression
src/sign-in/sign-in.repository.ts:31:16
             })
 
             // Case have user
-            if(user){
+            if(false){
                 // Compare hash in databse with hash digited
                 const passwordIsEqualForHash = await bcrypt.compare(password, user.password)

[NoCoverage] ConditionalExpression
src/sign-in/sign-in.repository.ts:31:16
             })
 
             // Case have user
-            if(user){
+            if(true){
                 // Compare hash in databse with hash digited
                 const passwordIsEqualForHash = await bcrypt.compare(password, user.password)

[NoCoverage] ConditionalExpression
src/sign-in/sign-in.repository.ts:35:20
                 // Compare hash in databse with hash digited
                 const passwordIsEqualForHash = await bcrypt.compare(password, user.password)
 
-                if(passwordIsEqualForHash) return user
+                if(false) return user
                
                 throw new Error('Password invalid!')

[NoCoverage] ConditionalExpression
src/sign-in/sign-in.repository.ts:35:20
                 // Compare hash in databse with hash digited
                 const passwordIsEqualForHash = await bcrypt.compare(password, user.password)
 
-                if(passwordIsEqualForHash) return user
+                if(true) return user
                
                 throw new Error('Password invalid!')

[NoCoverage] BlockStatement
src/sign-in/sign-in.repository.ts:43:25
             //  message for user
             throw new Error('Email not is exist in database!')
             
-        } catch (error) {
-            throw new BadRequestException ({
-                statusCode: HttpStatus.CONFLICT,
-                typeError: 'Login',
-                message: error.message
-            })      
-        }
+        } catch (error) {}
     }
 }

[NoCoverage] ObjectLiteral
src/sign-in/sign-in.repository.ts:44:44
             throw new Error('Email not is exist in database!')
             
         } catch (error) {
-            throw new BadRequestException ({
-                statusCode: HttpStatus.CONFLICT,
-                typeError: 'Login',
-                message: error.message
-            })      
+            throw new BadRequestException ({})      
         }
     }
