[NoCoverage] BlockStatement
src/signup/signup.controller.ts:16:71
   constructor(private readonly signupService: SignupService) {}
 
   @Post()
-  async createUser(@Res() response:Response, @Body() values:SignupDto){
-    try {
-
-      // Create user and retur id
-      const user = await this.signupService.createUser(values.email, values.username, values.password)
-
-      if(user){
-
-        // Return
-        return response.send(user)
-      }
-    } catch (error) {
-      return response.send(error)
-    }
-  }
+  async createUser(@Res() response:Response, @Body() values:SignupDto){}
 }
 

[NoCoverage] BlockStatement
src/signup/signup.controller.ts:17:9
 
   @Post()
   async createUser(@Res() response:Response, @Body() values:SignupDto){
-    try {
-
-      // Create user and retur id
-      const user = await this.signupService.createUser(values.email, values.username, values.password)
-
-      if(user){
-
-        // Return
-        return response.send(user)
-      }
-    } catch (error) {
+    try {} catch (error) {
       return response.send(error)
     }

[NoCoverage] BlockStatement
src/signup/signup.controller.ts:22:15
       // Create user and retur id
       const user = await this.signupService.createUser(values.email, values.username, values.password)
 
-      if(user){
-
-        // Return
-        return response.send(user)
-      }
+      if(user){}
     } catch (error) {
       return response.send(error)

[NoCoverage] ConditionalExpression
src/signup/signup.controller.ts:22:10
       // Create user and retur id
       const user = await this.signupService.createUser(values.email, values.username, values.password)
 
-      if(user){
+      if(true){
 
         // Return

[NoCoverage] BlockStatement
src/signup/signup.controller.ts:27:21
         // Return
         return response.send(user)
       }
-    } catch (error) {
-      return response.send(error)
-    }
+    } catch (error) {}
   }
 }
