[NoCoverage] ObjectLiteral
src/signup/signup.repository.ts:16:60
     async createUser(email:string, username:string, password:string){
         try {
 
-            const user = await this.prisma.user.findUnique({ where:{
-                email:email
-            } })
+            const user = await this.prisma.user.findUnique({})
 
             // User exist in database

[NoCoverage] ConditionalExpression
src/signup/signup.repository.ts:21:16
             } })
 
             // User exist in database
-            if(user){
+            if(true){
                 throw new Error('This user exist in database!')
             }

[NoCoverage] BlockStatement
src/signup/signup.repository.ts:21:21
             } })
 
             // User exist in database
-            if(user){
-                throw new Error('This user exist in database!')
-            }
+            if(user){}
 
             // Generate hash

[NoCoverage] BlockStatement
src/signup/signup.repository.ts:39:25
             
             // Return user
             return newUser
-        } catch (error) { 
-            throw new BadRequestException ({
-                statusCode: HttpStatus.CONFLICT,
-                typeError: 'not is possible user create in database!',
-                message: error.message
-            })      
-        }
+        } catch (error) {}
     }
 }
