[NoCoverage] BlockStatement
src/signup/signup.service.ts:13:69
     constructor(private SignupRepository:SignupRepository){}
 
     // Create user
-    async createUser(email:string, username:string, password:string){
-        return await this.SignupRepository.createUser(email, username, password)
-    }
+    async createUser(email:string, username:string, password:string){}
 }
 
