[NoCoverage] BlockStatement
src/task/task.controller.ts:18:61
   constructor(private readonly taskService: TaskService) {}
 
   @Post()
-  async createTask(@Req() req:Request, @Body() task:TaskDto){
-
-    // Get id user in cookie storage
-    const userId = req.cookies['user']
-
-    // Create task
-    if(userId){
-      return await this.taskService.createTask(task.name, userId)
-    }
-
-    // Message for error
-    return {
-      message: 'You not have permission!!'
-    }
-  }
+  async createTask(@Req() req:Request, @Body() task:TaskDto){}
 
   @Get()

[NoCoverage] ConditionalExpression
src/task/task.controller.ts:24:8
     const userId = req.cookies['user']
 
     // Create task
-    if(userId){
+    if(false){
       return await this.taskService.createTask(task.name, userId)
     }

[NoCoverage] BlockStatement
src/task/task.controller.ts:24:15
     const userId = req.cookies['user']
 
     // Create task
-    if(userId){
-      return await this.taskService.createTask(task.name, userId)
-    }
+    if(userId){}
 
     // Message for error

[NoCoverage] BlockStatement
src/task/task.controller.ts:35:47
   }
 
   @Get()
-  async getAllTasksForUser(@Req() req:Request){
-    // Get id user in cookie storage
-    const userId = req.cookies['user']
-
-    // Find all tasks for user
-    if(userId){
-      return await this.taskService.getAllTasksForUser(userId)
-    }
-
-    // Message for error
-    return{
-      message:'You not have permission!!'
-    }
-  }
+  async getAllTasksForUser(@Req() req:Request){}
 
   @Patch()

[NoCoverage] StringLiteral
src/task/task.controller.ts:37:32
   @Get()
   async getAllTasksForUser(@Req() req:Request){
     // Get id user in cookie storage
-    const userId = req.cookies['user']
+    const userId = req.cookies[""]
 
     // Find all tasks for user

[NoCoverage] BlockStatement
src/task/task.controller.ts:40:15
     const userId = req.cookies['user']
 
     // Find all tasks for user
-    if(userId){
-      return await this.taskService.getAllTasksForUser(userId)
-    }
+    if(userId){}
 
     // Message for error

[NoCoverage] ConditionalExpression
src/task/task.controller.ts:40:8
     const userId = req.cookies['user']
 
     // Find all tasks for user
-    if(userId){
+    if(false){
       return await this.taskService.getAllTasksForUser(userId)
     }

[NoCoverage] StringLiteral
src/task/task.controller.ts:46:15
 
     // Message for error
     return{
-      message:'You not have permission!!'
+      message:""
     }
   }

[NoCoverage] BlockStatement
src/task/task.controller.ts:51:73
   }
 
   @Patch()
-  async updateTask(@Req() req:Request, @Body() taskValues:TaskUpdateDto){
-    // Get id user in cookie storage
-    const userId = req.cookies['user'] 
-
-    // Update task
-    if(userId){
-      return await this.taskService.updateTask(taskValues)
-    }
-
-    // Message for error
-    return{
-      message:'You not have permission!!'
-    }
-  }
+  async updateTask(@Req() req:Request, @Body() taskValues:TaskUpdateDto){}
 
   @Delete('/:taskId')

[NoCoverage] BlockStatement
src/task/task.controller.ts:56:15
     const userId = req.cookies['user'] 
 
     // Update task
-    if(userId){
-      return await this.taskService.updateTask(taskValues)
-    }
+    if(userId){}
 
     // Message for error

[NoCoverage] ConditionalExpression
src/task/task.controller.ts:56:8
     const userId = req.cookies['user'] 
 
     // Update task
-    if(userId){
+    if(true){
       return await this.taskService.updateTask(taskValues)
     }

[NoCoverage] ObjectLiteral
src/task/task.controller.ts:61:11
     }
 
     // Message for error
-    return{
-      message:'You not have permission!!'
-    }
+    return{}
   }
 

[NoCoverage] BlockStatement
src/task/task.controller.ts:67:71
   }
 
   @Delete('/:taskId')
-  async deleteTask(@Req() req:Request, @Param('taskId') taskId:string){
-    // Get id user in cookie storage
-    const userId = req.cookies['user']
-
-    // Delete task
-    if(userId){
-      return await this.taskService.deleteTask(taskId)
-    }
-
-    // Message for error
-    return{
-      message:'You not have permission!!'
-    }
-  }
+  async deleteTask(@Req() req:Request, @Param('taskId') taskId:string){}
   
 }

[NoCoverage] ConditionalExpression
src/task/task.controller.ts:72:8
     const userId = req.cookies['user']
 
     // Delete task
-    if(userId){
+    if(true){
       return await this.taskService.deleteTask(taskId)
     }

[NoCoverage] ConditionalExpression
src/task/task.controller.ts:72:8
     const userId = req.cookies['user']
 
     // Delete task
-    if(userId){
+    if(false){
       return await this.taskService.deleteTask(taskId)
     }
