[NoCoverage] BlockStatement
src/task/task.repository.ts:16:49
     constructor(private prisma:PrismaService){}
 
     // Create task
-    async createTask(name:string, userId:string){
-        try {
-            const createTask = await this.prisma.task.create({
-                data:{
-                    id: crypto.randomUUID(),
-                    name,
-                    userId,
-                    isChecked:false
-                }
-            })
-
-            if(createTask){
-                return {
-                    message:'Created task in database'
-                }
-            }
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async createTask(name:string, userId:string){}
 
     // Get all tasks for user

[NoCoverage] BlockStatement
src/task/task.repository.ts:17:13
 
     // Create task
     async createTask(name:string, userId:string){
-        try {
-            const createTask = await this.prisma.task.create({
-                data:{
-                    id: crypto.randomUUID(),
-                    name,
-                    userId,
-                    isChecked:false
-                }
-            })
-
-            if(createTask){
-                return {
-                    message:'Created task in database'
-                }
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] BooleanLiteral
src/task/task.repository.ts:23:31
                     id: crypto.randomUUID(),
                     name,
                     userId,
-                    isChecked:false
+                    isChecked:true
                 }
             })

[NoCoverage] ConditionalExpression
src/task/task.repository.ts:27:16
                 }
             })
 
-            if(createTask){
+            if(true){
                 return {
                     message:'Created task in database'

[NoCoverage] ConditionalExpression
src/task/task.repository.ts:27:16
                 }
             })
 
-            if(createTask){
+            if(false){
                 return {
                     message:'Created task in database'

[NoCoverage] StringLiteral
src/task/task.repository.ts:29:29
 
             if(createTask){
                 return {
-                    message:'Created task in database'
+                    message:""
                 }
             }

[NoCoverage] BlockStatement
src/task/task.repository.ts:38:44
     }
 
     // Get all tasks for user
-    async getAllTasksForUser(userId:string){
-        try {
-            const allTasks = await this.prisma.task.findMany({
-                where:{userId}
-            })
-
-            if(allTasks){
-                return allTasks
-            }
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async getAllTasksForUser(userId:string){}
 
     // Update task

[NoCoverage] BlockStatement
src/task/task.repository.ts:39:13
 
     // Get all tasks for user
     async getAllTasksForUser(userId:string){
-        try {
-            const allTasks = await this.prisma.task.findMany({
-                where:{userId}
-            })
-
-            if(allTasks){
-                return allTasks
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] ConditionalExpression
src/task/task.repository.ts:44:16
                 where:{userId}
             })
 
-            if(allTasks){
+            if(false){
                 return allTasks
             }

[NoCoverage] ConditionalExpression
src/task/task.repository.ts:44:16
                 where:{userId}
             })
 
-            if(allTasks){
+            if(true){
                 return allTasks
             }

[NoCoverage] BlockStatement
src/task/task.repository.ts:53:49
     }
 
     // Update task
-    async updateTask(taskValues:TaskUpdateProps){
-        try {
-            // Updating task
-            await this.prisma.task.update({
-                where:{
-                    id:taskValues.taskId
-                },
-                data:{
-                    name:taskValues.name,
-                    isChecked:taskValues.isChecked
-                }
-            })
-
-            // Message
-            return{
-                message:'Task updated!'
-            }
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async updateTask(taskValues:TaskUpdateProps){}
 
     // Delete task

[NoCoverage] BlockStatement
src/task/task.repository.ts:54:13
 
     // Update task
     async updateTask(taskValues:TaskUpdateProps){
-        try {
-            // Updating task
-            await this.prisma.task.update({
-                where:{
-                    id:taskValues.taskId
-                },
-                data:{
-                    name:taskValues.name,
-                    isChecked:taskValues.isChecked
-                }
-            })
-
-            // Message
-            return{
-                message:'Task updated!'
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] ObjectLiteral
src/task/task.repository.ts:57:23
         try {
             // Updating task
             await this.prisma.task.update({
-                where:{
-                    id:taskValues.taskId
-                },
+                where:{},
                 data:{
                     name:taskValues.name,

[NoCoverage] BlockStatement
src/task/task.repository.ts:76:36
     }
 
     // Delete task
-    async deleteTask(taskId:string){
-        try {
-            await this.prisma.task.delete({
-                where:{id: taskId}
-            })
-
-            return {
-                message:'Task deleted'
-            }
-        } catch (error) {
-            console.log(error)
-        }
-    }
+    async deleteTask(taskId:string){}
 }

[NoCoverage] BlockStatement
src/task/task.repository.ts:77:13
 
     // Delete task
     async deleteTask(taskId:string){
-        try {
-            await this.prisma.task.delete({
-                where:{id: taskId}
-            })
-
-            return {
-                message:'Task deleted'
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.log(error)
         }

[NoCoverage] ObjectLiteral
src/task/task.repository.ts:79:23
     async deleteTask(taskId:string){
         try {
             await this.prisma.task.delete({
-                where:{id: taskId}
+                where:{}
             })
 
