[NoCoverage] BlockStatement
src/task/task.service.ts:15:49
     constructor(private TaskRepository:TaskRepository){}
 
     // Create task
-    async createTask(name:string, userId:string){
-        return await this.TaskRepository.createTask(name, userId)
-    }
+    async createTask(name:string, userId:string){}
 
     // Get all tasks for user

[NoCoverage] BlockStatement
src/task/task.service.ts:20:44
     }
 
     // Get all tasks for user
-    async getAllTasksForUser(userId:string){
-        return await this.TaskRepository.getAllTasksForUser(userId)
-    }
+    async getAllTasksForUser(userId:string){}
 
     // Update Task

[NoCoverage] BlockStatement
src/task/task.service.ts:25:49
     }
 
     // Update Task
-    async updateTask(taskValues:TaskUpdateProps){
-        return await this.TaskRepository.updateTask(taskValues)
-    }
+    async updateTask(taskValues:TaskUpdateProps){}
 
     // Delete Task

[NoCoverage] BlockStatement
src/task/task.service.ts:30:36
     }
 
     // Delete Task
-    async deleteTask(taskId:string){
-        return this.TaskRepository.deleteTask(taskId)
-    }
+    async deleteTask(taskId:string){}
 }
 
