[NoCoverage] BlockStatement
src/themes/themes.controller.ts:15:21
   constructor(private readonly themesService: ThemesService) {}
 
   @Get()
-  async findThemes(){
-    return await this.themesService.findThemes()
-  }
+  async findThemes(){}
 
   @Post()

[NoCoverage] BlockStatement
src/themes/themes.controller.ts:20:46
   }
 
   @Post()
-  async insertTheme(@Body() params:ThemesDto){
-    return await this.themesService.insertTheme(params.image_url, params.video_url)
-  }
+  async insertTheme(@Body() params:ThemesDto){}
 }
 
