[NoCoverage] BlockStatement
src/themes/themes.repository.ts:14:23
     constructor(private prisma:PrismaService){}
 
     // Return all themes
-    async findThemes(){
-        return await this.prisma.themes.findMany()
-    }
+    async findThemes(){}
 
     // Insert themes

[NoCoverage] ConditionalExpression
src/themes/themes.repository.ts:30:56
             // Push user in allUsers
 
             // Get admin verification
-            const verifiedUser = allUsers.find(user => user.dataUser.email === process.env.TOKEN)
+            const verifiedUser = allUsers.find(user => false)
 
             // Logic case is verified admin

[NoCoverage] ArrowFunction
src/themes/themes.repository.ts:30:48
             // Push user in allUsers
 
             // Get admin verification
-            const verifiedUser = allUsers.find(user => user.dataUser.email === process.env.TOKEN)
+            const verifiedUser = allUsers.find(() => undefined)
 
             // Logic case is verified admin

[NoCoverage] ConditionalExpression
src/themes/themes.repository.ts:33:16
             const verifiedUser = allUsers.find(user => user.dataUser.email === process.env.TOKEN)
 
             // Logic case is verified admin
-            if(verifiedUser){
+            if(true){
                 // Create new theme
                 await this.prisma.themes.create({

[NoCoverage] BlockStatement
src/themes/themes.repository.ts:33:29
             const verifiedUser = allUsers.find(user => user.dataUser.email === process.env.TOKEN)
 
             // Logic case is verified admin
-            if(verifiedUser){
-                // Create new theme
-                await this.prisma.themes.create({
-                    data:{
-                        image_url,
-                        video_url,
-                    }
-                })
-
-                // Return message
-                return {
-                    message: 'Created theme in database'
-                }
-            }
+            if(verifiedUser){}
 
             // Erro message

[NoCoverage] StringLiteral
src/themes/themes.repository.ts:44:30
 
                 // Return message
                 return {
-                    message: 'Created theme in database'
+                    message: ""
                 }
             }

[NoCoverage] ObjectLiteral
src/themes/themes.repository.ts:49:20
             }
 
             // Erro message
-            return {
-                message:'You not is verified',
-            }
+            return {}
 
         } catch (error) {

[NoCoverage] StringLiteral
src/themes/themes.repository.ts:50:25
 
             // Erro message
             return {
-                message:'You not is verified',
+                message:"",
             }
 

[NoCoverage] BlockStatement
src/themes/themes.repository.ts:53:25
                 message:'You not is verified',
             }
 
-        } catch (error) {
-            return{
-                message:'Error! Not is possible create theme',
-            }
-        }
+        } catch (error) {}
             
     }

[NoCoverage] StringLiteral
src/themes/themes.repository.ts:55:25
 
         } catch (error) {
             return{
-                message:'Error! Not is possible create theme',
+                message:"",
             }
         }
