[NoCoverage] BlockStatement
src/themes/themes.service.ts:11:23
     constructor(private ThemesRepository:ThemesRepository){}
 
     // Find all themes
-    async findThemes(){
-        // Find all themes in database
-        const allThemes = await this.ThemesRepository.findThemes()
-
-        // Return all themes
-        return allThemes.length > 0 ? allThemes : {message:'Not have Themes.'}
-    }
+    async findThemes(){}
 
     // Insert Theme

[NoCoverage] ConditionalExpression
src/themes/themes.service.ts:16:16
         const allThemes = await this.ThemesRepository.findThemes()
 
         // Return all themes
-        return allThemes.length > 0 ? allThemes : {message:'Not have Themes.'}
+        return true ? allThemes : {message:'Not have Themes.'}
     }
 

[NoCoverage] ConditionalExpression
src/themes/themes.service.ts:16:16
         const allThemes = await this.ThemesRepository.findThemes()
 
         // Return all themes
-        return allThemes.length > 0 ? allThemes : {message:'Not have Themes.'}
+        return false ? allThemes : {message:'Not have Themes.'}
     }
 

[NoCoverage] BlockStatement
src/themes/themes.service.ts:20:58
     }
 
     // Insert Theme
-    async insertTheme(image_url:string, video_url:string){
-        return await this.ThemesRepository.insertTheme(image_url, video_url)
-    }
+    async insertTheme(image_url:string, video_url:string){}
 }
 
